interface Props {
  lng: string;
  type: string;
}

export default ({ lng, type }: Props) => {
  if (lng === "fa") {
    if (type === "traditional-restaurant")
      return [
        "کباب",
        "خورشت",
        "غذای با برنج",
        "غذای محلی",
        "ناهار",
        "شام",
        "سالاد",
        "غذای دریایی",
        "مخلفات",
        "نوشیدنی",
        "دسر",
      ];
    if (type === "fast-food")
      return [
        "پیش غذا",
        "پیتزا",
        "مرغ سوخاری",
        "پاستا",
        "سالاد",
        "برگر",
        "غذای پرسی",
        "نوشیدنی",
      ];
    if (type === "cafe-restaurant")
      return [
        "کباب",
        "خورشت",
        "غذای با برنج",
        "سالاد",
        "کیک",
        "ناهار",
        "صبحانه",
        "شام",
        "نوشیدنی سرد",
        "نوشیدنی گرم",
        "چای",
      ];
    if (type === "cafe")
      return [
        "چای",
        "قهوه",
        "کیک",
        "غذای پرسی",
        "صبحانه",
        "دسر",
        "میلک شیک",
        "بستنی",
        "ساندویچ",
      ];
    if (type === "traditional-cafe")
      return [
        "نوشیدنی سرد",
        "نوشیدنی گرم",
        "قلیان",
        "ساندویچ",
        "غذاهای آبکی",
        "غذای پرسی",
      ];
  }

  return [];
};
